Tekla Open API Reference for Tekla Structures 2025
Cloud.Points Property
 The list of points for the cloud. The points you insert will specify the corner points of the cloud. After you insert the object, you will get every cloud point back.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PointList Points { get; set; }
Public Property Points As PointList
	Get
	Set
Property Value
Type: PointList
See Also
Reference
Cloud Class
Tekla.Structures.Drawing Namespace